<?php
/**
 * Created by PhpStorm.
 * User: arash
 * Date: 12/7/2018
 * Time: 6:06 PM
 */

defined('BASEPATH') OR exit('No direct script access allowed');

class Migration_Seed_testai extends CI_Migration
{

    public function up()
    {
        //add question to table
        $query = "
        INSERT INTO `question` (`question_id`, `question`, `question_type`, `question_level`, `time_created`) VALUES
            (37, 'کلمه CSS مخفف کدام عبارت است؟', 1, 1, '2018-11-25'),
            (38, 'کد صحیح برای ایجاد ارتباط بین یک صفحه HTML با یک فایل CSS کدام است ؟ ', 1, 1, '2018-11-25'),
            (39, 'محل صحیح قرار دادن کد لینک به یک فایل CSS در صفحات HTML کجاست ؟ ', 1, 1, '2018-11-25'),
            (40, 'کدام تگ برای تعیین یک کد CSS درون صفحات HTML ، به کار می رود ؟', 1, 1, '2018-11-25'),
            (41, 'کدام خاصیت در یک تگ HTML برای تعیین خواص CSS استفاده می شود ؟', 1, 1, '2018-11-25'),
            (43, ' روش صحیح وارد کردن توضیحات Comments در CSS کدام است ؟', 1, 1, '2018-11-25'),
            (44, 'کدام خاصیت CSS برای تعیین یک پس زمینه برای عناصر استفاده می شود ؟', 1, 1, '2018-11-25'),
            (45, 'چگونه می توان خاصیت پس زمینه را برای تمام تگ های h1 تعیین کرد ؟ ', 1, 1, '2018-11-25'),
            (46, 'خاصیت صحیح برای تعیین رنگ متن و توشته در CSS کدام است ؟', 1, 1, '2018-11-25'),
            (47, 'چرا هر کامپیوتری می تواند صفحات وب را بخواند ؟', 1, 1, '2018-11-30'),
            (48, ' تیتر صفحه در کدام قسمت نوشته می شود ؟', 1, 1, '2018-11-30'),
            (49, 'در تیتر نمی توان هیچ گونه فرمت ………… یا ………….. قرار داد.', 1, 1, '2018-11-30'),
            (50, 'برای شروع پاراگراف جدید از چه روشی استفاده می کنیم ؟', 1, 1, '2018-11-30'),
            (51, 'معادل کاراکتر فضای خالی در استاندارد Unicode چیست ؟', 1, 1, '2018-11-30'),
            (52, 'در صورتی که فونت انتخابی شما برای طراحی صفحات در مرورگر ملاقات کننده موجود نباشد چه اتفاقی می افتد ؟', 1, 1, '2018-11-30'),
            (53, 'برای تغییر اندازه و رنگ فونت بطور کلی از کدام تگ استفاده می شود ؟', 1, 1, '2018-11-30'),
            (54, 'چگونه می توان رنگ متن را پیش فرض تعیین کرد ؟', 1, 1, '2018-11-30'),
            (55, 'اعداد یا حروفی را که اندکی بالاتر از متن اصلی نوشته می شوند چه می نامند ؟', 1, 1, '2018-11-30'),
            (56, 'کدام تگ زیر ، تگ سربرگ است و اولین تگ پس از تگ HTML   می باشد ، در این تگ می توان تگ های Meta  را به کار برد ؟', 1, 1, '2018-11-30');

        ";

        $this->db->query($query);

        //add answer to table
        $query = "
        INSERT INTO `answer` (`answer_id`, `answer`, `question_id`, `correct`) VALUES
            (110, 'Computer Style Sheets', 37, 0),
            (111, 'Cascading Style Sheets', 37, 1),
            (112, 'Colorful Style Sheets', 37, 0),
            (113, 'Creative Style Sheets', 37, 0),
            (114, '< / \\\"style src = \\\"mystyle.css >', 38, 0),
            (115, '< \\\"link href = \\\"stylesheet\\\" type = \\\"text/css\\\" rel = \\\"mystyle.css >', 38, 0),
            (116, '< stylesheet > mystyle.css < /stylesheet / >', 38, 0),
            (117, '< \\\"link rel = \\\"stylesheet\\\" type = \\\"text/css\\\" href = \\\"mystyle.css >', 38, 1),
            (118, 'در ابتدای صفحه', 39, 0),
            (119, 'در انتهای صفحه', 39, 0),
            (120, 'در قسمت < head > صفحه', 39, 1),
            (121, 'در قسمت < body > صفحه', 39, 0),
            (122, '< script >', 40, 0),
            (123, '< style >', 40, 1),
            (124, '< stylesheet >', 40, 0),
            (125, '< css >', 40, 0),
            (126, 'Style', 41, 1),
            (127, 'Class', 41, 0),
            (128, 'Theme', 41, 0),
            (129, 'Styles', 41, 0),
            (130, 'body:color=black', 42, 0),
            (131, '{body:color=black(body}', 42, 0),
            (132, '{ body { color: black', 42, 1),
            (133, '{body;color:black}', 42, 0),
            (134, 'this is a comment //', 43, 0),
            (135, '// this is a comment //', 43, 0),
            (136, '\\\" this is a comment / \\\"', 43, 0),
            (137, '/* this is a comment */', 43, 1),
            (138, ': bgcolor', 44, 0),
            (139, ': background-color', 44, 1),
            (140, ': backgroundcolor', 44, 0),
            (141, ': color', 44, 0),
            (142, '{ h1 {background-color:#FFFFFF', 45, 1),
            (143, '{ h1.all {background-color:#FFFFFF', 45, 0),
            (144, '{ all.h1 {background-color:#FFFFFF', 45, 0),
            (145, '{ h1.class {background-color:#FFFFFF', 45, 0),
            (146, ': fgcolor', 46, 0),
            (147, ': color', 46, 1),
            (148, '= text-color', 46, 0),
            (149, ': text-color', 46, 0),
            (150, 'چون سند های HTML  بصورت کدهای ASCII و یا فایلهای فقط متن ذخیره می شوند', 47, 1),
            (151, 'چون تمام کامپیوترها از سیستم عامل یکسان استفاده می کنند', 47, 0),
            (152, 'چون تمام کامپوترها از BROWSER  های یکسان استفاده می کنند', 47, 0),
            (153, 'چون سند های HTML متناسب با BROWSER  ها طراحی می شوند', 47, 0),
            (154, 'در حد فاصل  <HEAD > …….. < /HEAD > ', 48, 1),
            (155, 'در حد فاصل  <BODY > ……. < /BODY >', 48, 0),
            (156, 'در حد فاصل <HTML >  …….  < HEAD >', 48, 0),
            (157, 'در حد فاصل </HEAD > ……… < BODY >', 48, 0),
            (158, 'تصویر – پیوند', 49, 1),
            (159, 'متن فارسی – عدد', 49, 0),
            (160, ' : – ;', 49, 0),
            (161, ' حروف – علامت ها', 49, 0),
            (162, 'از تگ  &lt;Br> استفاده می کنیم', 50, 0),
            (163, ' از تگ &lt;hr>  استفاده می کنیم', 50, 0),
            (164, 'از تگ &lt;p>  استفاده می کنیم', 50, 1),
            (165, 'Enter  می زنیم', 50, 0),
            (166, 'Nspn', 51, 0),
            (167, '&nspn', 51, 0),
            (168, 'Nbsp', 51, 0),
            (169, ' &nbsp', 51, 1),
            (170, 'فونت انتخابی Download  می شود', 52, 0),
            (171, ' فونت از پیش برگزیده مرورگر به نمایش در می آید', 52, 1),
            (172, 'فونت انتخابی نمایش داده می شود', 52, 0),
            (173, 'بجای فونت انتخابی علامت سوال نمایش داده می شود', 52, 0),
            (174, 'Font style', 53, 0),
            (175, 'Font', 53, 1),
            (176, 'Base font', 53, 0),
            (177, 'Style', 53, 0),
            (178, '&lt;Body font:”#rrggbb”>', 54, 0),
            (179, '&lt;Body text:”#rrggbb”>', 54, 1),
            (180, '&lt;Body color:”#rrggbb”>', 54, 0),
            (181, '&lt;Body Style:”#rrggbb”>', 54, 0),
            (182, 'sub style', 55, 0),
            (183, 'sub script', 55, 0),
            (184, 'superscrip', 55, 1),
            (185, 'super style', 55, 0),
            (186, 'title', 56, 0),
            (187, 'head', 56, 1),
            (188, 'header', 56, 0),
            (189, 'body', 56, 0);
        ";

        $this->db->query($query);

    }

    public function down()
    {

    }
}